Revit 2027 API
ConductorSize.GetConductorSizeIds Method
 Gets all the Conductor Size ids in the given document, sorted by name.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static IList<ElementId> GetConductorSizeIds(
	Document document
)
Public Shared Function GetConductorSizeIds (
	document As Document
) As IList(Of ElementId)
public:
static IList<ElementId^>^ GetConductorSizeIds(
	Document^ document
)
static member GetConductorSizeIds :
        document : Document -> IList<ElementId>
Parameters
document Document
 The document.
Return Value
IList<ElementId>
 All the Conductor Size ids in this document.
Exceptions
Exception | Condition
ArgumentException |  document is not a project document.
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements).
See Also
Reference
ConductorSize Class
Autodesk.Revit.DB.Electrical Namespace